
#2) შექმენით პროგრამა while ციკლის საშვალებით რომელიც გამოთვლის ყველა ნატურალური რიცხვის ჯამს 1-იდან 50-მდე

# i = 1

# sum = 0

# while i < 50:
#     sum += i 
#     i += 1
# print(sum)




#3) შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) მანამდე სანამ არ შეიყვანს 1234-ს

# password = "1234"

# guess = ""

# while guess != password:
#     guess = input("Enter Pin: ")
# print("Thats Correct!")




#4) შექმნით რიცხვის გამოცნობის თამაში while ციკლით, რომელიც მომხმარებელს შეეკითხება რიცხვს 1-დან 10-მდე, სანამ მომხმარებელი არ შეიყვანს თქვენთვის სასურველ რიცხვს


# my_number = 9

# guess_number = 0


# while guess_number != my_number:
#     guess_number = int(input("Enter Your Number: "))





#5) ტექსტურ ფაილში ახსენით როდის ვიყენებთ while ციკლს და როდის for ციკლს


# for - როცა ვიცით იტერაციების რაოდენობა
# wlihe - როცა არვიცით რამდენჯერ მეორდება






    
    
    






