#1) შექმენით რიცხვების სია, შემდგარი მინიმუმ 10 ელემენტისგან. გადაუარეთ ამ საის while loop-ის გამოყენებით. გაიგეთ ცალკე ლუწი და კენტი რიცხვების ჯამი, საბოლოოდ შეადარეთ ისინი ერთმანეთს და დაპრინტეთ უდიდესი



# numbers = [3, 12, 7, 18, 5, 22, 9, 4, 15, 20]


# # ცვლადები ლუწი და კენტი რიცხვების ჯამისთვის
# even_sum = 0
# odd_sum = 0

# # ინდექსი, რომლითაც გადავუვლით სიას
# index = 0

# # while ციკლი
# while index < len(numbers):
#     if numbers[index] % 2 == 0:
#         even_sum += numbers[index]
#     else:
#         odd_sum += numbers[index]
#     index += 1

# # უდიდესი რიცხვი
# print (max(even_sum, odd_sum))




#2) შექმენით სიმბოლოების სია, გადაუარეთ მას for loop-ით და სიიდან ყველა სიმბოლოს შორის მოახდინეთ კონკადინაცია. ციკლის გარეთ დაგჭირდებათ ცვლადი სადაც შაამატებთ ამ სთრინგებს

# სიმბოლოების სია
# symbols = ['a', 'b', 'c', 'd', 'e']

# # ცვლადი, სადაც შევინახავთ შედეგს
# result = ""

# # for loop
# for symbol in symbols:
#     result += symbol  

# print(result)