#2) for ციკლით მომხარებელს შემოატანინეთ 5 ელემენტი სიაში და დაბეჭდეთ სია


# names = []

# for i in range(5):
#     name = input("Enter names: ")
#     names.append(name)


# print("Created List:", names)




#3) შექმენით ხილების სია, სადაც გექნებათ მინიმუმ 3 ელემენტი. მომხარებელს შემოატანინეთ თავისი საყვარელი ხილი, თუ სიის ბოლო ელემენტის ინდექსი არის ლუწი ჩაამატეთ შემოტანილი ხილი სიაში, სხვა შემთხვევაში არ ჩაამატოთ 


# fruit_list = ["Apple", "Banana", "Mango"]

# user_choose = input("Favorite Fruit: ")


# if len(fruit_list) % 2 == 0:
#     fruit_list.append(user_choose)
#     print(user_choose)
# else:
#     print("Can't Added")



# print(fruit_list)




#4) შექმენით სია შემდგარი სახელებისგან. მომხარებელს შემოატანინეთ მისი სახელი, თუ მისი სახელი იქნება 5 სიმბოლოს ტოლი ან მეტი. ჩაამატეთ სიაში, სხვა შემთხვევაში დაუბეჭდეთ "Name is too short"



# names = ["ირაკლი" , "ლუკა" , "ნიკა"]


# user_name = input("Enter Your Name: ")

# if len(user_name) >= 5:
#     names.append(user_name)
#     print(user_name)
# else:
#     print("Name is too short")

# print(names)







#5) შექმენით სია შემდგარი 10 ელემენტისგან. დაპრინტეთ ის და მომხარებელს შემოატანინეთ რიცხვი 1-დან 10-ჩათვლით. შემდეგ წაშალეთ სიის ის ელემენტი რომელი რიცხვიც გადმოგეცათ და დაპრინტეთ განახლებული სია




# Family_members = ["Giorgi" , "Irakli" , "Nino", "Guli" , "Demuri", "Leila", "Mari", "Nini", "Anastasia", "Nuca"]

# print(Family_members)

# user = int(input("Enter Number from 1-10: "))

# if 1 <= user <= 10:
#     Family_members.pop(user - 1)
# else:
#     print("გთხოვთ, შეიყვანოთ რიცხვი 1-დან 10-ის ჩათვლით.")



# print(Family_members)




#6) კომენტარებით ახსენით რა არის ინდექსი და მოიყვანეთ მაგალითი


#fruits = ["ვაშლი", "მსხალი", "ბანანი", "ანანასი"]

# ეს სია შეიცავს 4 ელემენტს, რომელთაც ინდექსები აქვთ მინიჭებული:

# "ვაშლი" — ინდექსი 0
# "მსხალი" — ინდექსი 1
# "ბანანი" — ინდექსი 2
# "ანანასი" — ინდექსი 3

#Python-ში სიის ინდექსები იწყება 0-დან, ანუ სიის პირველი ელემენტის ინდექსი არის 0, მეორე ელემენტის - 1 და ასე შემდეგ. ინდექსის გამოყენებით შეგვიძლია წვდომა ნებისმიერ კონკრეტულ ელემენტზე სიაში.